brew 'atuin'
brew 'autojump'
brew 'bat'
brew 'broot'
brew 'chezmoi'
brew 'direnv'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'gibo'
brew 'git-delta'
# I use imagemagick to create and set a black wallpaper
brew 'imagemagick'
brew 'killport'
brew 'lazygit'
brew 'lsd'
brew 'neovim'
brew 'ripgrep'
brew 'tldr'
brew 'tmux'
brew 'wget'
brew 'yt-dlp'
brew 'zsh-autocomplete'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'zsh-vi-mode'
brew 'zsh-you-should-use'

cask 'alacritty'
cask 'alfred'
cask 'blackhole-2ch'
cask 'dropbox'
cask 'foxitreader'
cask 'google-chrome'
cask 'karabiner-elements'
cask 'keepassxc'
cask 'maccy'
cask 'microsoft-edge'
cask 'microsoft-office'
cask 'obs'
cask 'shottr'
cask 'utm'
cask 'visual-studio-code'
cask 'xmind'

tap '8ta4/extension'
# This Brewfile specifies each package with its fully qualified name
# to avoid any possible name conflicts now or in the future.
# https://github.com/Homebrew/brew/blob/3b3300546b5a4e40b74f4ee33cf225cca280defe/docs/Taps.md?plain=1#L59-L62
brew '8ta4/extension/extension'

tap '8ta4/say'
cask '8ta4/say/say'

# https://github.com/lsd-rs/lsd/blob/58a8723cfa699d426bc3933c8aca91ad19ffee25/README.md?plain=1#L25
tap 'homebrew/cask-fonts'
cask 'homebrew/cask-fonts/font-fira-code-nerd-font'

tap 'koekeishiya/formulae'
brew 'koekeishiya/formulae/skhd'
brew 'koekeishiya/formulae/yabai'
