brew "atuin"
brew "autojump"
brew "chezmoi"
brew "direnv"
brew "fd"
brew "fzf"
brew "gh"
brew "gibo"
brew "git-delta"
brew "lazygit"
brew "neovim"
brew "nnn"
brew "ripgrep"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "wget"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
brew "zsh-vi-mode"

cask "alacritty"
cask "alfred"
cask "dropbox"
cask "foxitreader"
cask "google-chrome"
cask "karabiner-elements"
cask "keepassxc"
cask "maccy"
cask "microsoft-edge"
cask "microsoft-office"
cask "obs"
cask "utm"
cask "visual-studio-code"
cask "xmind"

tap "8ta4/extension"
# This Brewfile specifies each package with its fully qualified name
# to avoid any possible name conflicts now or in the future.
# https://github.com/Homebrew/brew/blob/3b3300546b5a4e40b74f4ee33cf225cca280defe/docs/Taps.md?plain=1#L59-L62
brew "8ta4/extension/extension"

tap "koekeishiya/formulae"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

tap "homebrew/cask-versions"
cask "homebrew/cask-versions/visual-studio-code-insiders"
