brew "atuin"
brew "autojump"
brew "chezmoi"
brew "direnv"
brew "fd"
brew "fzf"
brew "gh"
brew "gibo"
brew "git-delta"
brew "lazygit"
brew "neovim"
brew "nnn"
brew "ripgrep"
brew "tldr"
brew "tmux"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "alacritty"
cask "alfred"
cask "displaylink"
cask "dropbox"
cask "google-chrome"
cask "karabiner-elements"
cask "keepassxc"
cask "maccy"
cask "microsoft-edge"
cask "microsoft-office"
cask "obs"
cask "utm"
cask "visual-studio-code"

tap "koekeishiya/formulae"
brew "skhd"
brew "yabai"

tap "homebrew/cask-versions"
cask "visual-studio-code-insiders"
